INSERT INTO `reader`.`books`(
`name`, `sub_name`, `author`,
`publishing_house`,`producer`,
`original_author`,`translator`,
`year_of_publication`,`pages_num`,
`price`,`binding_and_layout`,`ISBN`, `describe`)
VALUES
('太白金星有点烦','', '马伯庸','湖南文艺出版社','博集天卷','','','2023-6','276','45.00','平装','9787572610912', ''),
('长安的荔枝','', '马伯庸','湖南文艺出版社','博集天卷','','','2022-10','224','45.00','平装','9787572608582', ''),
('长安十二时辰 上','', '马伯庸','湖南文艺出版社','博集天卷','','','2017-1','328','39.80','平装','9787540478315', ''),
('长安十二时辰 下','', '马伯庸','湖南文艺出版社','博集天卷','','','2017-1-1','310','39.80','平装','9787540478339', ''),
('两京十五日','', '马伯庸','湖南文艺出版社','博集天卷','','','2020-7','584','108.00','平装','9787540496715', ''),
('显微镜下的大明','', '马伯庸','湖南文艺出版社','博集天卷','','','2019-1','344','52.00','平装','9787540488475', ''),
('风起陇西','', '马伯庸','山西人民出版社','','','','2011-1','320','29.80', '平装', '9787203070696', ''),
('古董局中局','', '马伯庸','北京联合出版公司','','','','2015-12','316','32.00','平装','9787550264618', ''),
('古董局中局 2','《清明上河图》之谜', '马伯庸','北京联合出版公司','','','','2015-12','304','32.00','平装','9787550264595', ''),
('古董局中局 3','掠宝清单', '马伯庸','北京联合出版公司','','','','2015-12','304','32.00','平装','9787550264595', ''),
('古董局中局 4','大结局', '马伯庸','北京联合出版公司','','','','2015-12','400','42.00','平装','978755DELETE0264601', ''),
('食南之徒','', '马伯庸','印刻','','','','2024-5','352','','平装','9789863877264', ''),
('我在北京送快递','', '胡安焉','湖南文艺出版社','浦睿文化','','','2023-3','296','56.00','平装','9787572609268', ''),
('生活在低处','', '胡安焉','湖南文艺出版社','浦睿文化','','','2024-8', '280', '56.00','平装','9787572619830', ''),
('明亮的夜晚','', '[韩]崔恩荣','台海出版社','磨铁·大鱼读品','밝은 밤','叶蕾','2023-8', '296', '52','平装','9787516835265', ''),
('巨流河','', '齐邦媛','生活·读书·新知三联书店','','','','2010-10', '398', '39.00','平装','9787108034731', ''),
('城南旧事','', '林海音','译林出版社','','','齐邦媛,殷张兰熙','2011-4', '268', '25.00','平装','9787108034731', ''),
('呼兰河传','', '萧红','译林出版社','','','','2014-1', '240', '19.80','精装','9787544741811', ''),
('回忆鲁迅先生','', '萧红','古吴轩出版社','竹石文化','','','2024-4-23', '192', '49.80','平装','9787554623299', ''),
('萧红：我的血液里没有屈服','', '萧红',' 浙江文艺出版社','','','','2024-5', '', '39.80','平装','9787533974916', ''),
('呼兰河传','', '萧红',' 译林出版社','','','','2023-4', '357', '36.00','平装','9787544796057', ''),
('村上春树的音乐异想世界','用音乐治愈疲惫的灵魂', '[日] 村上春树','浙江人民出版社','磨铁·文治图书','','杨明绮','2024-11', '405', '96.00','精装','9787213116230', ''),
('俄国思想史','从启蒙运动到马克思主义', '[波] 安杰伊·瓦利茨基','译林出版社','','','刘文飞','2024-11', '576', '128.00','精装','9787575301169', ''),
('导读罗尔斯《正义论》','', '[美]弗兰克·拉维特','上海文艺出版社','拜德雅','','张晓川','2024-11', '228', '48.00','平装','9787532191062', ''),
('导读拉康','', '(英)肖恩·霍默','重庆大学出版社','拜德雅','','李新雨','2014-9-1', '225', 'CNY 29.00','平装','9787562484332', ''),
('福柯：关键概念','', '[美]狄安娜·泰勒 编','拜德雅丨重庆大学出版社','拜德雅','','庞弘','2020-1', '272', '48.00','平装','9787568918626', ''),
('现象学导论','', '[美] 罗伯特·索科拉夫斯基','上海文化出版社','后浪','','张建华,高秉江','2021-3', '312', '49.80','平装','9787553521428', ''),
('导读齐泽克','', '(英)托尼·迈尔斯','重庆大学出版社','拜德雅','','白轻','2014-8', '195', '28.00','平装','9787562484448', ''),
('导读德勒兹','', '(英)克莱尔· 科勒布鲁克','重庆大学出版社','拜德雅','','廖鸿飞','2014-8', '244', 'CNY 28.00','平装','9787562482765', ''),
('导读福柯《规训与惩罚》','', '[英]安妮·施沃恩 / [英]史蒂芬·夏皮罗',' 拜德雅 | 重庆大学出版社','拜德雅','','庞弘','2018-6', '200', '35.00','平装','9787568910552', ''),
('导读德勒兹与加塔利《千高原》','', '[美] 尤金·W.霍兰德','拜德雅丨重庆大学出版社','拜德雅','','周兮吟','2016-12-1', '216', '32.00','平装','9787568902168', ''),
('消费主义如何操控我们','', '[英]齐格蒙特·鲍曼','文汇出版社','读客文化','','李康','2024-11-11', '304', '69.90','精装','9787549643493', ''),
('城市中的布迪厄','挑战城市理论', '[法] 华康德','上海人民出版社','','','陆兵哲','2024-11', '337', '78.00','平装','9787208189034', ''),
('哲学塑造的世界','从柏拉图到数字时代', ' [美] 斯科特·索姆斯','九州出版社','后浪','','刘一白 / 黄禹迪',' 2024-12', '456', '88.00','平装','9787522532707', '')
;

Select * from `reader`.`books`;

# 清空单张表
truncate table `reader`.`books`;

# Alter table `reader`.`books` Add sub_name varchar(45);






